-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Фев 09 2021 г., 22:35
-- Версия сервера: 8.0.19
-- Версия PHP: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `shop`
--

-- --------------------------------------------------------

--
-- Структура таблицы `product`
--

CREATE TABLE `product` (
  `id` int NOT NULL,
  `N` int NOT NULL,
  `Код` int NOT NULL,
  `Новинка` varchar(3) NOT NULL,
  `Назва` varchar(255) NOT NULL,
  `Ціна` decimal(9,2) NOT NULL,
  `Видавництво` varchar(50) NOT NULL,
  `Сторінки` smallint NOT NULL,
  `Формат` varchar(9) DEFAULT NULL,
  `Дата` date NOT NULL,
  `Тираж` int NOT NULL DEFAULT '5000',
  `Тема` varchar(50) NOT NULL,
  `Категорія` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `product`
--

INSERT INTO `product` (`id`, `N`, `Код`, `Новинка`, `Назва`, `Ціна`, `Видавництво`, `Сторінки`, `Формат`, `Дата`, `Тираж`, `Тема`, `Категорія`) VALUES
(1, 2, 5110, 'No', 'Аппаратные средства мультимедия. Видеосистема РС', '15.51', 'BHV С.-Петербург', 400, '70х100/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Підручники'),
(2, 8, 4985, 'No', 'Освой самостоятельно модернизацию и ремонт ПК за 24 часа, 2-е изд.', '18.90', 'Вильямс', 288, '70х100/16', '2000-07-07', 5000, 'Використання ПК в цілому', 'Підручники'),
(3, 9, 5141, 'No', 'Структуры данных и алгоритмы.', '37.80', 'Вильямс', 384, '70х100/16', '2000-09-29', 5000, 'Використання ПК в цілому', 'Підручники'),
(4, 20, 5127, 'Yes', 'Автоматизация инженерно-графических работ', '11.58', 'Питер', 256, '70х100/16', '2000-06-15', 5000, 'Використання ПК в цілому', 'Підручники'),
(5, 31, 5111, 'No', 'Аппаратные средства мультимедия. Видеосистема РС', '15.51', 'BHV С.-Петербург', 400, '70х100/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(6, 46, 5199, 'No', 'Железо IBM 2001.', '30.07', 'МикроАрт', 368, '70х100/16', '2000-12-02', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(7, 50, 3851, 'Yes', 'Защита информации и безопасность компьютерных систем', '26.00', 'DiaSoft', 480, '84х108/16', '1999-02-04', 5000, 'Використання ПК в цілому', 'Захист і безпека ПК'),
(8, 58, 3932, 'No', 'Как превратить персональный компьютер в измерительный комплекс', '7.65', 'ДМК', 144, '60х88/16', '1999-06-09', 5000, 'Використання ПК в цілому', 'Інші книги'),
(9, 59, 4713, 'No', 'Plug- ins. Встраиваемые приложения для музыкальных программ', '11.41', 'ДМК', 144, '70х100/16', '2000-02-22', 5000, 'Використання ПК в цілому', 'Інші книги'),
(10, 175, 5217, 'No', 'Windows МЕ. Новейшие версии программ', '16.57', 'Триумф', 320, '70х100/16', '2000-08-25', 5000, 'Операційні системи', 'Windows 2000'),
(11, 176, 4829, 'No', 'Windows 2000 Professional шаг за шагом с СD', '27.25', 'Эком', 320, '70х100/16', '2000-04-28', 5000, 'Операційні системи', 'Windows 2000'),
(12, 188, 5170, 'No', 'Linux Русские версии', '24.43', 'ДМК', 346, '70х100/16', '2000-09-29', 5000, 'Операційні системи', 'Linux'),
(13, 191, 860, 'No', 'Операционная система UNIX', '3.50', 'BHV С.-Петербург', 395, '84х10016', '1997-05-05', 5000, 'Операційні системи', 'Unix'),
(14, 203, 44, 'No', 'Ответы на актуальные вопросы по OS/2 Warp', '5.00', 'DiaSoft', 352, '60х84/16', '1996-03-20', 5000, 'Операційні системи', 'Інші операційні системи'),
(15, 206, 5176, 'No', 'Windows Ме. Спутник пользователя', '12.79', 'Русская редакция', 306, '', '2000-10-10', 5000, 'Операційні системи', 'Інші операційні системи'),
(16, 209, 5462, 'No', 'Язык программирования С++. Лекции и упражнения', '29.00', 'DiaSoft', 656, '84х108/16', '2000-12-12', 5000, 'Програмування', 'C&C++'),
(17, 210, 4982, 'No', 'Язык программирования С. Лекции и упражнения', '29.00', 'DiaSoft', 432, '84х108/16', '2000-12-07', 5000, 'Програмування', 'C&C++'),
(18, 220, 4687, 'No', 'Эффективное использование C++. 50 рекомендаций по улучшению ваших программ и проектов', '17.60', 'ДМК', 240, '70х100/16', '2000-03-02', 5000, 'Програмування', 'C&C++');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `N` (`N`),
  ADD UNIQUE KEY `Код` (`Код`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `product`
--
ALTER TABLE `product`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
